#ifndef FilterData1000_H
#define FilterData1000_H
#include "../../ConstData.h"
namespace FilterData1000
{
    namespace lowpass
    {
        namespace fc15
        {
            //15Hz低通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.002080567135492, 0.004161134270985, 0.002080567135492
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.866892279712,   0.8752145482537
            };
        }
        namespace fc30
        {
            //30Hz低通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.007820208033497,  0.01564041606699, 0.007820208033497
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.734725768809,   0.7660066009433
            };
        }
        namespace fc55
        {
            //55Hz低通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.02384755629891,  0.04769511259782,  0.02384755629891
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.518132540718,   0.6135227659133
            };

        }
        namespace fc70
        {
            //70Hz低通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.03657483584393,  0.07314967168786,  0.03657483584393
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.390895281425,   0.5371946248011
            };
        }
        namespace fc100
        {
            //100Hz低通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.06745527388907,   0.1349105477781,  0.06745527388907
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,    -1.14298050254,   0.4128015980962
            };

        }
    }
    namespace highpass
    {
        namespace fc0_3
        {
            //0.3Hz高通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.998668022988,   -1.997336045976,    0.998668022988
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.997334271813,   0.9973378201396
            };

        }
        namespace fc0_5
        {
            //0.5Hz高通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.9977810241029,   -1.995562048206,   0.9977810241029
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.995557124346,    0.995566972066
            };

        }
        namespace fc1
        {
            //1Hz高通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.9955669720176,   -1.991133944035,   0.9955669720176
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.991114292202,   0.9911535958689
            };

        }
        namespace fc3
        {
            //3Hz高通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.9867597804394,   -1.973519560879,   0.9867597804394
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.973344249781,   0.9736948719763
            };

        }
        namespace fc50
        {
            //50Hz高通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.8005924034646,   -1.601184806929,   0.8005924034646
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.561018075801,   0.6413515380576
            };

        }
        namespace fc100
        {
            //100Hz高通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.638945525159,   -1.277891050318,    0.638945525159
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,    -1.14298050254,   0.4128015980962
            };

        }
        namespace fc150
        {
            //150Hz高通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.5050010290459,   -1.010002058092,   0.5050010290459
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,  -0.7477891782585,    0.272214937925
            };

        }
        namespace fc200
        {
            //200Hz高通
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.3913357725018,  -0.7826715450035,   0.3913357725018
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,  -0.3695273773512,   0.1958157126558
            };
        }
    }
    namespace notch
    {
        namespace fc50
        {
            //50Hz带阻
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.9998401665019,   -1.901809011211,   0.9998401665019
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,   -1.901809011211,   0.9996803330038
            };

        }
        namespace fc60
        {
            //60Hz带阻
            /*
             * 离散时间 IIR 滤波器(实数)
             * ----------------
             * 滤波器结构  : 直接 II 型
             * 分子 长度  : 3
             * 分母 长度  : 3
             * 稳定     : 是
             * 线性相位   : 否
             */
            const int NL = 3;
            const real64_T NUM[3] =
            {
                0.9998401665019,    -1.85925575292,   0.9998401665019
            };
            const int DL = 3;
            const real64_T DEN[3] =
            {
                1,    -1.85925575292,   0.9996803330038
            };

        }
    }

}


#endif
